In [25]:
import pandas as pd
import numpy as np

DataFrame 만들기

In [9]:
dict = {'Name': ['Gildong', 'Sarang', 'Jiemae', 'Yeoin', 'James', 'Sen'],
        'Grade': [1, 3, 4, 2, 3, 4],
        'Score': [56000, 23000, 44000, 52000, 52000, 60000]}
df = pd.DataFrame(dict)
print(df)

      Name  Grade  Score
0  Gildong      1  56000
1   Sarang      3  23000
2   Jiemae      4  44000
3    Yeoin      2  52000
4    James      3  52000
5      Sen      4  60000

**열 이름 변경**
1. columns
    * 모든 컬럼 이름을 변경

2. rename
    * 변경할 이름의 컬럼만 지정

- columns

In [3]:
df.columns = ['name', 'grade','score']

In [4]:
df

      name  grade  score
0  Gildong      1  56000
1   Sarang      3  23000
2   Jiemae      4  44000
3    Yeoin      2  52000
4    James      3  52000
5      Sen      4  60000

- rename

In [5]:
df.rename(columns = {'name':'Name'})

      Name  grade  score
0  Gildong      1  56000
1   Sarang      3  23000
2   Jiemae      4  44000
3    Yeoin      2  52000
4    James      3  52000
5      Sen      4  60000

**열 삭제**
  * drop() 매소드를 사용
    * aixs = 0 : 행 삭제(기본값)
    * axis = 1: 열 삭제
    * inplace = False: 삭제한 것처럼 조회
    * inplace = True: 진짜 삭제

In [35]:
df1 = df.copy()

In [36]:
df1.drop(['Name','Score'],axis = 1, inplace = True)
df1

   Grade
0      1
1      3
2      4
3      2
4      3
5      4

**값 변경**

In [27]:
df1 = df.copy()

In [11]:
# 열 전체 값 변경
df1['Score'] = 0
df1

      Name  Grade  Score
0  Gildong      1      0
1   Sarang      3      0
2   Jiemae      4      0
3    Yeoin      2      0
4    James      3      0
5      Sen      4      0

In [22]:
# 조건에 의한 변경1
df1.loc[df1['Score'] > 59000, 'Score'] = 0
df1

      Name  Grade  Score
0  Gildong      1  56000
1   Sarang      3  23000
2   Jiemae      4  44000
3    Yeoin      2  52000
4    James      3  52000
5      Sen      4      0

In [34]:
# 조건에 의한 변경2
df1['Score'] = np.where(df1['Score'] > 55000, 1, 0)
df1

      Name  Grade  Score
0  Gildong      1      1
1   Sarang      3      0
2   Jiemae      4      0
3    Yeoin      2      0
4    James      3      0
5      Sen      4      1

- **df.map({'기존값': 새로운 값)**
    - 범주형 값을 다른 값으로 변경

In [41]:
df1 = df.copy()

In [42]:
df1['Name'] = df1['Name'].map({'Sen':1, 'James':2, 'Yeoin':3, 'Jiemae':4, 'Sarang': 5, 'Gildong':6})
df1

   Name  Grade  Score
0     6      1  56000
1     5      3  23000
2     4      4  44000
3     3      2  52000
4     2      3  52000
5     1      4  60000

- **cut()**
    - 숫자형 변수를 범주형 변수로 변환

In [52]:
df1 = df.copy()

In [53]:
df1['Score'] = pd.cut(df1['Score'], bins =[22000, 55000, 60000] , labels = ['B','A'])
df1

      Name  Grade Score
0  Gildong      1     A
1   Sarang      3     B
2   Jiemae      4     B
3    Yeoin      2     B
4    James      3     B
5      Sen      4     A